GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F15276.inc
;----- ADCON0 Bits -----------------------------------------------------
ON_ADCON0        EQU  H'0000'
GO_ADCON0        EQU  H'0001'
ADON             EQU  H'0000'
GO_NDONE         EQU  H'0001'
ADGO             EQU  H'0001'


;----- ADCON1 Bits -----------------------------------------------------
FM               EQU  H'0007'
ADFM             EQU  H'0007'


;----- RB1I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RB2I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RC3I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RC4I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'


;----- RC1STA Bits -----------------------------------------------------
RX9D             EQU  H'0000'
OERR             EQU  H'0001'
FERR             EQU  H'0002'
ADDEN            EQU  H'0003'
CREN             EQU  H'0004'
SREN             EQU  H'0005'
RX9              EQU  H'0006'
SPEN             EQU  H'0007'


;----- TX1STA Bits -----------------------------------------------------
TX9D             EQU  H'0000'
TRMT             EQU  H'0001'
BRGH             EQU  H'0002'
SENDB            EQU  H'0003'
SYNC_TX1STA      EQU  H'0004'
TXEN             EQU  H'0005'
TX9              EQU  H'0006'
CSRC             EQU  H'0007'


;----- BAUD1CON Bits -----------------------------------------------------
ABDEN            EQU  H'0000'
WUE              EQU  H'0001'
BRG16            EQU  H'0003'
SCKP             EQU  H'0004'
RCIDL            EQU  H'0006'
ABDOVF           EQU  H'0007'


;----- SSP1ADD Bits -----------------------------------------------------
MSK0             EQU  H'0000'
MSK1             EQU  H'0001'
MSK2             EQU  H'0002'
MSK3             EQU  H'0003'
MSK4             EQU  H'0004'
MSK5             EQU  H'0005'
MSK6             EQU  H'0006'
MSK7             EQU  H'0007'
MSK01            EQU  H'0000'
MSK11            EQU  H'0001'
MSK21            EQU  H'0002'
MSK31            EQU  H'0003'
MSK41            EQU  H'0004'
MSK51            EQU  H'0005'
MSK61            EQU  H'0006'
MSK71            EQU  H'0007'


;----- SSP1MSK Bits -----------------------------------------------------
MSK0             EQU  H'0000'
MSK1             EQU  H'0001'
MSK2             EQU  H'0002'
MSK3             EQU  H'0003'
MSK4             EQU  H'0004'
MSK5             EQU  H'0005'
MSK6             EQU  H'0006'
MSK7             EQU  H'0007'


;----- SSP1STAT Bits -----------------------------------------------------
BF               EQU  H'0000'
UA               EQU  H'0001'
R_NW             EQU  H'0002'
S                EQU  H'0003'
P                EQU  H'0004'
D_NA             EQU  H'0005'
CKE              EQU  H'0006'
SMP              EQU  H'0007'
R_W              EQU  H'0002'
D_A              EQU  H'0005'
NW               EQU  H'0002'
NA               EQU  H'0005'
NWRITE           EQU  H'0002'
NADDRESS         EQU  H'0005'
READ_WRITE       EQU  H'0002'
DATA_ADDRESS     EQU  H'0005'
I2C_READ         EQU  H'0002'
I2C_START        EQU  H'0003'
I2C_STOP         EQU  H'0004'
I2C_DAT          EQU  H'0005'
BF1              EQU  H'0000'
UA1              EQU  H'0001'
R                EQU  H'0002'
START            EQU  H'0003'
STOP             EQU  H'0004'
D                EQU  H'0005'
CKE1             EQU  H'0006'
SMP1             EQU  H'0007'
RW               EQU  H'0002'
START1           EQU  H'0003'
STOP1            EQU  H'0004'
DA               EQU  H'0005'
RW1              EQU  H'0002'
I2C_START1       EQU  H'0003'
I2C_STOP2        EQU  H'0004'
DA1              EQU  H'0005'
I2C_READ1        EQU  H'0002'
S2               EQU  H'0003'
P2               EQU  H'0004'
DATA_ADDRESS1    EQU  H'0005'
READ_WRITE1      EQU  H'0002'
D_A1             EQU  H'0005'
R_W1             EQU  H'0002'
D_NA1            EQU  H'0005'
R_NW1            EQU  H'0002'
I2C_DAT1         EQU  H'0005'
NW2              EQU  H'0002'
NA2              EQU  H'0005'
NWRITE1          EQU  H'0002'
NADDRESS1        EQU  H'0005'


;----- SSP1CON1 Bits -----------------------------------------------------
CKP              EQU  H'0004'
SSPEN            EQU  H'0005'
SSPOV            EQU  H'0006'
WCOL             EQU  H'0007'
SSPM0            EQU  H'0000'
SSPM1            EQU  H'0001'
SSPM2            EQU  H'0002'
SSPM3            EQU  H'0003'
SSPM01           EQU  H'0000'
SSPM11           EQU  H'0001'
SSPM21           EQU  H'0002'
SSPM31           EQU  H'0003'
CKP1             EQU  H'0004'
SSPEN1           EQU  H'0005'
SSPOV1           EQU  H'0006'
WCOL1            EQU  H'0007'


;----- SSP1CON2 Bits -----------------------------------------------------
SEN              EQU  H'0000'
RSEN             EQU  H'0001'
PEN              EQU  H'0002'
RCEN             EQU  H'0003'
ACKEN            EQU  H'0004'
ACKDT            EQU  H'0005'
ACKSTAT          EQU  H'0006'
GCEN             EQU  H'0007'
ADMSK1           EQU  H'0001'
ADMSK2           EQU  H'0002'
ADMSK3           EQU  H'0003'
ADMSK4           EQU  H'0004'
ADMSK5           EQU  H'0005'
SEN1             EQU  H'0000'
ADMSK11          EQU  H'0001'
ADMSK21          EQU  H'0002'
ADMSK31          EQU  H'0003'
ACKEN1           EQU  H'0004'
ACKDT1           EQU  H'0005'
ACKSTAT1         EQU  H'0006'
GCEN1            EQU  H'0007'
RSEN1            EQU  H'0001'
PEN1             EQU  H'0002'
RCEN1            EQU  H'0003'
ADMSK41          EQU  H'0004'
ADMSK51          EQU  H'0005'


;----- SSP1CON3 Bits -----------------------------------------------------
DHEN             EQU  H'0000'
AHEN             EQU  H'0001'
SBCDE            EQU  H'0002'
SDAHT            EQU  H'0003'
BOEN             EQU  H'0004'
SCIE             EQU  H'0005'
PCIE             EQU  H'0006'
ACKTIM           EQU  H'0007'


;----- TMR1L Bits -----------------------------------------------------
TMR1L0           EQU  H'0000'
TMR1L1           EQU  H'0001'
TMR1L2           EQU  H'0002'
TMR1L3           EQU  H'0003'
TMR1L4           EQU  H'0004'
TMR1L5           EQU  H'0005'
TMR1L6           EQU  H'0006'
TMR1L7           EQU  H'0007'


;----- TMR1H Bits -----------------------------------------------------
TMR1H0           EQU  H'0000'
TMR1H1           EQU  H'0001'
TMR1H2           EQU  H'0002'
TMR1H3           EQU  H'0003'
TMR1H4           EQU  H'0004'
TMR1H5           EQU  H'0005'
TMR1H6           EQU  H'0006'
TMR1H7           EQU  H'0007'


;----- T1CON Bits -----------------------------------------------------
ON_T1CON         EQU  H'0000'
RD16             EQU  H'0001'
NOT_SYNC         EQU  H'0002'
TMR1ON           EQU  H'0000'
T1RD16           EQU  H'0001'
NOT_T1SYNC       EQU  H'0002'
T1CKPS0          EQU  H'0004'
T1CKPS1          EQU  H'0005'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
RD161            EQU  H'0001'


